# Friday the 13th

... Today is "Friday the 13th" !!

## List of 13th

In [1]:
from datetime import date
import pandas as pd

In [2]:
l = [date(year, month, 13) 
        for year in range(1980, 2019)
        for month in range(1, 13)]

df = pd.DataFrame(l, columns=["date"])
df.tail()

           date
463  2018-08-13
464  2018-09-13
465  2018-10-13
466  2018-11-13
467  2018-12-13

In [3]:
!cal 2018

                            2018
      January               February               March
Su Mo Tu We Th Fr Sa  Su Mo Tu We Th Fr Sa  Su Mo Tu We Th Fr Sa
    1  2  3  4  5  6               1  2  3               1  2  3
 7  8  9 10 11 12 13   4  5  6  7  8  9 10   4  5  6  7  8  9 10
14 15 16 17 18 19 20  11 12 13 14 15 16 17  11 12 13 14 15 16 17
21 22 23 24 25 26 27  18 19 20 21 22 23 24  18 19 20 21 22 23 24
28 29 30 31           25 26 27 28           25 26 27 28 29 30 31


       April                  May                   June
Su Mo Tu We Th Fr Sa  Su Mo Tu We Th Fr Sa  Su Mo Tu We Th Fr Sa
 1  2  3  4  5  6  7         1  2  3  4  5                  1  2
 8  9 10 11 12 13 14   6  7  8  9 10 11 12   3  4  5  6  7  8  9
15 16 17 18 19 20 21  13 14 15 16 17 18 19  10 11 12 13 14 15 16
22 23 24 25 26 27 28  20 21 22 23 24 25 26  17 18 19 20 21 22 23
29 30                 27 28 29 30 31        24 25 26 27 28 29 30


        July                 August              September
Su Mo Tu We Th Fr Sa  Su Mo Tu We Th Fr Sa  Su Mo Tu We Th Fr Sa
 1  2  3  4  5  6  7            1  2  3  4                     1
 8  9 10 11 12 13 14   5  6  7  8  9 10 11   2  3  4  5  6  7  8
15 16 17 18 19 20 21  12 13 14 15 16 17 18   9 10 11 12 13 14 15
22 23 24 25 26 27 28  19 20 21 22 23 24 25  16 17 18 19 20 21 22
29 30 31              26 27 28 29 30 31     23 24 25 26 27 28 29
                                            30

      October               November              December
Su Mo Tu We Th Fr Sa  Su Mo Tu We Th Fr Sa  Su Mo Tu We Th Fr Sa
    1  2  3  4  5  6               1  2  3                     1
 7  8  9 10 11 12 13   4  5  6  7  8  9 10   2  3  4  5  6  7  8
14 15 16 17 18 19 20  11 12 13 14 15 16 17   9 10 11 12 13 14 15
21 22 23 24 25 26 27  18 19 20 21 22 23 24  16 17 18 19 20 21 22
28 29 30 31           25 26 27 28 29 30     23 24 25 26 27 28 29
                                            30 31

In [4]:
df["year"] = df["date"].apply(lambda d: d.year)
df["month"] = df["date"].apply(lambda d: d.month)
df.head()

         date  year  month
0  1980-01-13  1980      1
1  1980-02-13  1980      2
2  1980-03-13  1980      3
3  1980-04-13  1980      4
4  1980-05-13  1980      5

In [5]:
df["friday_13th"] = df["date"].apply(lambda d: d.weekday() == 4) # weekday 4 = Friday

df.drop("date", inplace=True, axis=1)
df.tail(10)

     year  month  friday_13th
458  2018      3        False
459  2018      4         True
460  2018      5        False
461  2018      6        False
462  2018      7         True
463  2018      8        False
464  2018      9        False
465  2018     10        False
466  2018     11        False
467  2018     12        False

## Count

In [6]:
import numpy as np

### Per Year

In [7]:
df_per_year = df[["year", "friday_13th"]].groupby(["year"]).agg(lambda x: np.sum(x))
df_per_year.head()

      friday_13th
year
1980            1
1981            3
1982            1
1983            1
1984            3

In [8]:
df_per_year.describe()

       friday_13th
count    39.000000
mean      1.743590
std       0.751068
min       1.000000
25%       1.000000
50%       2.000000
75%       2.000000
max       3.000000

### Per Month

In [9]:
# 1980 - 2018 : 39 years

In [10]:
df_per_month = df[["month", "friday_13th"]].groupby(["month"]).agg(lambda x: np.sum(x))
df_per_month

       friday_13th
month
1                6
2                6
3                6
4                6
5                6
6                6
7                6
8                5
9                5
10               5
11               6
12               5

In [11]:
def how_many_friday_13th(year):
    return len(list(
            filter(lambda d: d.weekday() == 4, 
                   [date(year, month, 13) for month in range(1, 13)])))

In [12]:
how_many_friday_13th(2018)

2

In [13]:
for year in range(1, 10000):
    n = how_many_friday_13th(year)
    if n not in (1, 2, 3): print(year, n)

## Hypothesis

** There is always one, two, or three "Friday the 13th" in any given year. **

## Really?

A month has "Friday the 13th" IF AND ONLY IF the month starts from Sunday.

In [14]:
!cal 4 2018

     April 2018
Su Mo Tu We Th Fr Sa
 1  2  3  4  5  6  7
 8  9 10 11 12 13 14
15 16 17 18 19 20 21
22 23 24 25 26 27 28
29 30

### Cases - Year

* Year starts from {Mon, Tue, Wed, Thu, Fri, Sat, Sun}
* {Leap, Non-Leap} Year

...

...

...

### Cases - Month

* A month starts from {Mon, Tue, Wed, Thu, Fri, Sat, Sun}
* A number of days in the month is {28, 29, 30, 31}

In [15]:
for d in range(28, 32):
    print( d, divmod(d, 7) )

28 (4, 0)
29 (4, 1)
30 (4, 2)
31 (4, 3)

If (February has F13) and (Not Leap Year)

-> March also has F13 -> April does not have

...

...

...

Showing the periodic-cycle of the calendar.

More elegant way of thinking this ?

...

...

[Friday the 13th - Wikipedia](https://en.wikipedia.org/wiki/Friday_the_13th)